/**
 * ************************************************************************
 *
 * @file CharacterView.h
 * @author AnakinLiu (azrael2759@qq.com)
 * @date 2025-12-04
 * @version 0.1
 * @brief 角色视图组件
    显示角色卡牌信息
    包含角色名称、技能描述等信息

    一个长方形区域，宽小于高度
    卡面（背景）是角色卡牌图案
    下方有一个或多个button
    显示技能名称，点击后弹出技能描述
 * - 左上角包含一个竖向的无滚动 `ListArea`，显示身份、阵营、角色名
 * - 右侧包含玩家名称、在线状态标签与操作按钮区域
 *
 * ************************************************************************
 * @copyright Copyright (c) 2025 AnakinLiu
 * For study and research only, no reprinting.
 * ************************************************************************
 */