/**
 * ************************************************************************
 *
 * @file NetRoomWidget.h
 * @author AnakinLiu (azrael2759@qq.com)
 * @date 2025-12-04
 * @version 0.1
 * @brief 网络房间界面组件
    右侧显示房间参数，左侧显示玩家列表
    类似红色警戒2的房间界面
    点击play按钮获取玩家数据发给服务器
    然后等待服务器开始游戏指令关闭此界面
 *
 * ************************************************************************
 * @copyright Copyright (c) 2025 AnakinLiu
 * For study and research only, no reprinting.
 * ************************************************************************
 */