/**
 * ************************************************************************
 * 
 * @file OtherPlayerView.h
 * @author AnakinLiu (azrael2759@qq.com)
 * @date 2025-12-04
 * @version 0.1
 * @brief 其他玩家视图组件
    * 显示其他玩家的信息，如头像、名称、状态等
    一个长方形区域，宽小于高度
    卡面（背景）是角色卡牌图案
    左上角有一个小的竖着的无滚动条的listArea 
    显示身份名称
    显示阵营名称
    显示角色名称

    右方有一个横向的label
    显示玩家名称
    有一个横向的label
    显示玩家状态（在线、离线）
    
    
 * 
 * ************************************************************************
 * @copyright Copyright (c) 2025 AnakinLiu
 * For study and research only, no reprinting.
 * ************************************************************************
 */